logs/sysbench/201905/20190523_1_4/thread_w01_20190526170654.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 1 tps: 400.72 qps: 2404.61 (r/w/o: 0.00/1603.07/801.54) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 430.92 qps: 2585.71 (r/w/o: 0.00/1723.87/861.84) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 450.79 qps: 2704.73 (r/w/o: 0.00/1803.15/901.58) lat (ms,95%): 4.03 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 461.91 qps: 2771.37 (r/w/o: 0.00/1847.55/923.82) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 465.60 qps: 2793.70 (r/w/o: 0.00/1862.50/931.20) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 470.20 qps: 2820.79 (r/w/o: 0.00/1880.39/940.40) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           107216
        other:                           53608
        total:                           160824
    transactions:                        26804  (446.67 per sec.)
    queries:                             160824 (2680.02 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0023s
    total number of events:              26804

Latency (ms):
         min:                                  1.43
         avg:                                  2.24
         max:                                 13.82
         95th percentile:                      4.10
         sum:                              59950.23

Threads fairness:
    events (avg/stddev):           26804.0000/0.00
    execution time (avg/stddev):   59.9502/0.00